#include <deque>
#include <iostream>

using namespace std;

int main()
{
	deque <int> елемент = {- 13, 0, 10, -4, 6, 11, 12, 28, 50, 89, 166, 304 };
	int i = 0;
	while (елемент.size() != 120)
	{
		елемент.push_back(елемент[i + 2] + елемент[i + 1] + елемент[i] - 1);
		елемент.push_front(елемент[i + 2] - елемент[i + 1] - елемент[i] + 1);
	//i++; //€ не став додавати зб≥льшенн€, оск≥льки дан≥ елемент≥в не м≥н€ютьс€ ≥ виход€ть т≥ сам≥ числа
	}
	for (size_t j = 0; j < елемент.size(); j++)
	{
		cout << елемент[j] << endl;
	}
	cout << елемент.size();
}